{
    "zh_cn.json":"用户协议\n于2024年6月21日更新\neasy lang由liang_work@github.com开发，其完全免费且公开，你可以将其用于你的项目。我们不会通过它监视你的行为，仅部分代码需要网络（网络不是必须的，你可以不用联网也它可以工作）。而在你使用时，它需要以下数据：\n1.你的计算机操作系统类型。\n2.你的计算机系统版本。\n3.你的计算机系统位数。\n4.你的Python环境版本。\n5.easy lang程序所在的目录及其版本。\n所有数据将存在cache.json文件中，数据为本地缓存数据，你可以使用'clear cache'指令清除，但你下一次启动它仍然会存在。所有，我们需要你同意以下协议：\n1.需要使用你计算机上的网络进行更新。\n2.禁止将程序用于违法违规的事情，我们将不会对你的行为进行负责。\n3.我们有权在不事先通知你的情况下更新改协议。\n当你完全同意以上协议时，输入'y'并回车。",
    "us_en.json":"User Agreement\nUpdated on June 21, 2024\nEasy Lang is developed by liang_work@github.com and is completely free and public, and you can use it for your projects. We don't monitor your behavior through it, only some of the code requires a network (network is not required, you can work without an internet connection). And when you use it, it requires the following data:\n1.Your computer's operating system type. \n2. Your computer system version. \n3. The number of bits of your computer system. \n4.Your version of the Python environment. \n5.The directory where the easy lang program is located and its version. \nAll data will be stored in cache.json file, the data is cached locally, you can clear it with the 'clear cache' command, but it will still be there the next time you start it. All of us need you to agree to the following agreements:\n1.Need to use the network on your computer for updates. \n2.It is forbidden to use the program for anything that violates laws and regulations, and we will not be responsible for your actions. \n3.We reserve the right to update the Agreement without prior notice to you. \nWhen you fully agree with the above agreement, type 'y' and press enter.",
    "zh_ft.json":"用f定\n於2024年6月21日更新\neasy lang由 liang_work@github.com _l，其完全免M且公_，你可以⑵溆渺赌愕０浮 我不通^它O你的行椋H部分代a需要W路（W路不是必的，你可以不用W也它可以工作）。 而在你使用r，它需要以下：\n1.你的算C操作系y型。 \n2.你的算C系y版本。 \n3.你的算C系y位怠 \n4.你的Pythonh境版本。 \n5.easy lang程式所在的目及其版本。 \n所有⒋嬖cache.jsonn中，楸镜鼐存，你可以使用'clear cache'指令清除，但你下一次铀仍然存在。 所有，我需要你同意以下f定：\n1.需要使用你算C上的W络M行更新。 \n2.禁止⒊绦蛴渺哆`法`的事情，我⒉δ愕男檫M行。 \n3.我有嘣诓皇孪韧ㄖ你的情r下更新改f定。 n你完全同意以上f定r，入'y'K回。"
}